In [1]:
import pandas as pd

In [2]:
numbers = pd.Series([10, 20, 30, 40, 50])

In [9]:
numbers.map(lambda i: i**3)

0      1000
1      8000
2     27000
3     64000
4    125000
dtype: int64

In [3]:
numbers

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [8]:
~numbers.isin([20, 30])

0     True
1    False
2    False
3     True
4     True
dtype: bool

In [7]:
numbers[~numbers.isin([20, 30])]

0    10
3    40
4    50
dtype: int64

In [ ]:
df = pd.read_excel("misthoi.xlsx", index_col="ID")
df.head()

      Όνομα  Ηλικία         Πόλη  Μισθός
ID
1   Γιάννης      28        Αθήνα    1500
2     Μαρία      34  Θεσσαλονίκη    1700
3    Κώστας      41        Πάτρα    1600
4     Ελένη      29     Ηράκλειο    1550
5     Νίκος      37       Λάρισα    1650

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 1 to 100
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Όνομα   100 non-null    object
 1   Ηλικία  100 non-null    int64
 2   Πόλη    100 non-null    object
 3   Μισθός  100 non-null    int64
dtypes: int64(2), object(2)
memory usage: 3.9+ KB

In [16]:
df.describe()

           Ηλικία       Μισθός
count  100.000000   100.000000
mean    33.870000  1607.500000
std      5.459964    88.538926
min     26.000000  1470.000000
25%     29.000000  1550.000000
50%     33.000000  1600.000000
75%     38.000000  1680.000000
max     45.000000  1800.000000